Repository: raghav-lightweightcode/commentxpert
Catalog: languages/commentxpert-*.po
Languages: ar, ja, zh_cn

source: Adds an option for users to mark comments as private, viewable only by admins and the comment author.
ar: يضيف خيارًا للمستخدمين لوضع علامة على التعليقات كخاصة، بحيث يمكن رؤيتها فقط من قبل المسؤولين ومؤلف التعليق.
ja: ユーザーがコメントを非公開としてマークし、管理者とコメント作成者だけが閲覧できるようにするオプションを追加します。
zh_cn: 添加一个选项，让用户将评论标记为私人评论，只有管理员和评论作者才能查看。

source: Allow site users to mark comments as private
ar: السماح لمستخدمي الموقع بوضع علامة على التعليقات على أنها خاصة
ja: サイトユーザーがコメントを非公開にできるようにする
zh_cn: 允许网站用户将评论标记为私人评论

source: Approve
ar: يعتمد
ja: 承認する
zh_cn: 批准

source: Comment made private successfully.
ar: تم جعل التعليق خاصًا بنجاح.
ja: コメントを非公開にしました。
zh_cn: 评论已成功设为私密。

source: Comment made public successfully.
ar: تم نشر التعليق بنجاح.
ja: コメントは正常に公開されました。
zh_cn: 评论公开成功。

source: CommentXpert Settings
ar: إعدادات CommentXpert
ja: コメントエキスパート設定
zh_cn: CommentXpert 设置

source: Enable Private Comments
ar: تمكين التعليقات الخاصة
ja: 非公開コメントを有効にする
zh_cn: 启用私人评论

source: Make Private
ar: جعل خاص
ja: 非公開にする
zh_cn: 设为私人

source: Make Public
ar: جعلها عامة
ja: 公開する
zh_cn: 公开

source: Make this comment public
ar: جعل هذا التعليق عامًا
ja: このコメントを公開する
zh_cn: 公开此评论

source: Post this comment as private
ar: نشر هذا التعليق كخاص
ja: このコメントを非公開として投稿する
zh_cn: 将此评论发布为私人评论

source: Private Comments Awaiting Approval
ar: تعليقات خاصة في انتظار الموافقة
ja: 承認待ちの非公開コメント
zh_cn: 私人评论正在等待批准

source: To enable private comments, please enable the <strong>"Users must be registered and logged in to comment"</strong> option in the <a href="%s">Discussion Settings</a>.
ar: لتفعيل التعليقات الخاصة، يرجى تفعيل خيار <strong>يجب على المستخدمين التسجيل وتسجيل الدخول للتعليق</strong> في <a href="%s">إعدادات المناقشة</a>.
ja: 非公開コメントを有効にするには、<a href="%s">ディスカッション設定</a>で<strong>「コメントするにはユーザーは登録してログインしている必要があります」</strong>オプションを有効にしてください。
zh_cn: 要启用私人评论，请在<a href="%s">讨论设置</a>中启用<strong>“用户必须注册并登录才能发表评论”</strong>选项。
